/*
 *《数值分析简明教程(第二版)》王能超编著
 *
 * Beijing University of Chemical Technology
 * March 1st, 2013 
 */

#include<iostream>
#include<stdio.h>
#include<stdlib.h>

using namespace std;

int main() {

    double a,b=0.0,d[10]= {0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00},e[10]= {1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00},f[10],g[10]; //倒数 平方 贝它 阿尔法
    int j=0,k=0,i=0;
    double x[10]= {0.10,0.20,0.30,0.40,0.50,0.60,0.70,0.80,0.90,1.00};
    double y[10]= {0.904837,0.818731,0.740818,0.670320,0.606531,0.548812,0.496585,0.449329,0.406570,0.367879};
    double m[10]= {-0.904837,-0.818731,-0.740818,-0.670320,-0.606531,-0.548812,-0.496585,-0.449329,-0.406570,-0.367879};
    cin>>a;
    for(j=0; j<10; j++) {
        for(k=0; k<10; k++) {
            if(k!=j) {
                d[j]+=1/(x[j]-x[k]);
                e[j]*=(a-x[k])/(x[j]-x[k]);
            }
        }
    }
    for(j=0; j<10; j++) {
        f[j]=(a-x[j])*(e[j]*e[j]);
        g[j]=(1-2*(a-x[j])*d[j])*(e[j]*e[j]);
        b+=(y[j]*g[j]+m[j]*f[j]);
    }
    cout<<b;

    return 0;
}